Revit 2027 API
SpecTypeId.LinearMomentScale Property
 Linear Moment Scale, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LinearMomentScale { get; }
Public Shared ReadOnly Property LinearMomentScale As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LinearMomentScale {
	ForgeTypeId^ get ();
}
static member LinearMomentScale : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace